results/gcs_standard/fio-rw:randrw-rwmixread:33-numjobs:10-iodepth:1-bs:1M.out
fio-rw:randrw-rwmixread:33-numjobs:10-iodepth:1-bs:1M: (g=0): rw=randrw, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
fio-3.28
Starting 10 processes
fio-rw:randrw-rwmixread:33-numjobs:10-iodepth:1-bs:1M: Laying out IO file (1 file / 4096MiB)
fio-rw:randrw-rwmixread:33-numjobs:10-iodepth:1-bs:1M: Laying out IO file (1 file / 4096MiB)
fio-rw:randrw-rwmixread:33-numjobs:10-iodepth:1-bs:1M: Laying out IO file (1 file / 4096MiB)
[...]

fio-rw:randrw-rwmixread:33-numjobs:10-iodepth:1-bs:1M: (groupid=0, jobs=10): err= 0: pid=25597: Sun Feb 25 23:39:15 2024
  read: IOPS=3, BW=3173KiB/s (3249kB/s)(2076MiB/670059msec)
    slat (msec): min=44, max=1629, avg=1445.64, stdev=86.22
    clat (nsec): min=4748, max=65631, avg=8136.12, stdev=2984.19
     lat (msec): min=44, max=1629, avg=1445.65, stdev=86.22
    clat percentiles (nsec):
     |  1.00th=[ 5728],  5.00th=[ 6688], 10.00th=[ 6944], 20.00th=[ 7264],
     | 30.00th=[ 7456], 40.00th=[ 7584], 50.00th=[ 7776], 60.00th=[ 7904],
     | 70.00th=[ 8096], 80.00th=[ 8384], 90.00th=[ 8768], 95.00th=[ 9408],
     | 99.00th=[18304], 99.50th=[29312], 99.90th=[39680], 99.95th=[58112],
     | 99.99th=[66048]
   bw (  KiB/s): min=20428, max=20520, per=100.00%, avg=20493.96, stdev= 2.18, samples=2066
   iops        : min=   19, max=   20, avg=20.00, stdev= 0.02, samples=2066
  write: IOPS=6, BW=6568KiB/s (6726kB/s)(4298MiB/670059msec); 0 zone resets
    slat (usec): min=503, max=1861, avg=612.16, stdev=72.45
    clat (nsec): min=1254, max=61503, avg=2721.86, stdev=1621.15
     lat (usec): min=505, max=1867, avg=615.80, stdev=73.22
    clat percentiles (nsec):
     |  1.00th=[ 1496],  5.00th=[ 1672], 10.00th=[ 1800], 20.00th=[ 1992],
     | 30.00th=[ 2160], 40.00th=[ 2352], 50.00th=[ 2544], 60.00th=[ 2736],
     | 70.00th=[ 2960], 80.00th=[ 3216], 90.00th=[ 3568], 95.00th=[ 3920],
     | 99.00th=[ 5984], 99.50th=[ 9024], 99.90th=[30080], 99.95th=[36096],
     | 99.99th=[61696]
   bw (  KiB/s): min=20480, max=319826, per=100.00%, avg=63032.59, stdev=5083.27, samples=1396
   iops        : min=   20, max=  312, avg=61.51, stdev= 4.96, samples=1396
  lat (usec)   : 2=14.23%, 4=50.17%, 10=34.03%, 20=1.21%, 50=0.31%
  lat (usec)   : 100=0.05%
  cpu          : usr=0.02%, sys=0.09%, ctx=13378, majf=0, minf=145
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2076,4298,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=3173KiB/s (3249kB/s), 3173KiB/s-3173KiB/s (3249kB/s-3249kB/s), io=2076MiB (2177MB), run=670059-670059msec
  WRITE: bw=6568KiB/s (6726kB/s), 6568KiB/s-6568KiB/s (6726kB/s-6726kB/s), io=4298MiB (4507MB), run=670059-670059msec

Disk stats (read/write):
  sdb: ios=8304/18595, merge=0/3, ticks=2998846/13266175, in_queue=16265025, util=99.87%