results/gcs_standard/fio-rw:rw-rwmixread:33-numjobs:1-iodepth:10-bs:4k.out
fio-rw:rw-rwmixread:33-numjobs:1-iodepth:10-bs:4k: (g=0): rw=rw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=10
fio-3.28
Starting 1 process
fio-rw:rw-rwmixread:33-numjobs:1-iodepth:10-bs:4k: Laying out IO file (1 file / 4096MiB)

fio-rw:rw-rwmixread:33-numjobs:1-iodepth:10-bs:4k: (groupid=0, jobs=1): err= 0: pid=20690: Sat Feb 24 20:44:09 2024
  read: IOPS=1513, BW=6055KiB/s (6200kB/s)(2018MiB/341360msec)
    slat (nsec): min=1611, max=257369, avg=2087.70, stdev=809.50
    clat (usec): min=30, max=332235k, avg=1335.41, stdev=653644.51
     lat (usec): min=31, max=332235k, avg=1337.57, stdev=653644.51
    clat percentiles (usec):
     |  1.00th=[   39],  5.00th=[   42], 10.00th=[   44], 20.00th=[   45],
     | 30.00th=[   47], 40.00th=[   48], 50.00th=[   49], 60.00th=[   50],
     | 70.00th=[   52], 80.00th=[   53], 90.00th=[   56], 95.00th=[   59],
     | 99.00th=[   71], 99.50th=[   76], 99.90th=[  141], 99.95th=[  163],
     | 99.99th=[  206]
   bw (  KiB/s): min=203312, max=251136, per=100.00%, avg=243150.59, stdev=10672.05, samples=17
   iops        : min=50828, max=62784, avg=60787.65, stdev=2668.01, samples=17
  write: IOPS=3071, BW=12.0MiB/s (12.6MB/s)(4096MiB/341360msec); 0 zone resets
    slat (usec): min=3, max=411, avg= 3.98, stdev= 1.73
    clat (usec): min=28, max=332235k, avg=2267.39, stdev=858405.77
     lat (usec): min=34, max=332235k, avg=2271.47, stdev=858405.77
    clat percentiles (usec):
     |  1.00th=[   39],  5.00th=[   42], 10.00th=[   44], 20.00th=[   46],
     | 30.00th=[   47], 40.00th=[   48], 50.00th=[   49], 60.00th=[   50],
     | 70.00th=[   52], 80.00th=[   53], 90.00th=[   56], 95.00th=[   59],
     | 99.00th=[   71], 99.50th=[   76], 99.90th=[  149], 99.95th=[  167],
     | 99.99th=[  212]
   bw (  KiB/s): min=412784, max=508328, per=100.00%, avg=493444.24, stdev=21772.90, samples=17
   iops        : min=103196, max=127082, avg=123361.06, stdev=5443.22, samples=17
  lat (usec)   : 50=59.78%, 100=40.07%, 250=0.15%, 500=0.01%, 1000=0.01%
  lat (msec)   : >=2000=0.01%
  cpu          : usr=1.02%, sys=1.75%, ctx=29435, majf=0, minf=18
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=516697,1048577,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=10

Run status group 0 (all jobs):
   READ: bw=6055KiB/s (6200kB/s), 6055KiB/s-6055KiB/s (6200kB/s-6200kB/s), io=2018MiB (2116MB), run=341360-341360msec
  WRITE: bw=12.0MiB/s (12.6MB/s), 12.0MiB/s-12.0MiB/s (12.6MB/s-12.6MB/s), io=4096MiB (4295MB), run=341360-341360msec

Disk stats (read/write):
  sdb: ios=0/29548, merge=0/0, ticks=0/9050878, in_queue=9050878, util=97.59%