results/gcs_standard/fio-rw:rw-rwmixread:33-numjobs:10-iodepth:10-bs:4k.out
fio-rw:rw-rwmixread:33-numjobs:10-iodepth:10-bs:4k: (g=0): rw=rw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=10
...
fio-3.28
Starting 10 processes
fio-rw:rw-rwmixread:33-numjobs:10-iodepth:10-bs:4k: Laying out IO file (1 file / 4096MiB)
fio-rw:rw-rwmixread:33-numjobs:10-iodepth:10-bs:4k: Laying out IO file (1 file / 4096MiB)
fio-rw:rw-rwmixread:33-numjobs:10-iodepth:10-bs:4k: Laying out IO file (1 file / 4096MiB)
[...]

fio-rw:rw-rwmixread:33-numjobs:10-iodepth:10-bs:4k: (groupid=0, jobs=10): err= 0: pid=22835: Sun Feb 25 06:47:50 2024
  read: IOPS=1452, BW=5809KiB/s (5949kB/s)(6848MiB/1207117msec)
    slat (nsec): min=1568, max=41214k, avg=2633.91, stdev=39660.02
    clat (usec): min=30, max=531695, avg=5054.00, stdev=21981.90
     lat (usec): min=32, max=531698, avg=5056.76, stdev=21981.85
    clat percentiles (usec):
     |  1.00th=[    41],  5.00th=[    45], 10.00th=[    46], 20.00th=[    49],
     | 30.00th=[    51], 40.00th=[    53], 50.00th=[    56], 60.00th=[    59],
     | 70.00th=[    66], 80.00th=[    76], 90.00th=[    86], 95.00th=[ 51643],
     | 99.00th=[107480], 99.50th=[107480], 99.90th=[111674], 99.95th=[111674],
     | 99.99th=[111674]
   bw (  KiB/s): min= 2904, max=2004832, per=100.00%, avg=23390.19, stdev=17002.30, samples=5996
   iops        : min=  726, max=501208, avg=5846.83, stdev=4250.58, samples=5996
  write: IOPS=2951, BW=11.5MiB/s (12.1MB/s)(13.6GiB/1207117msec); 0 zone resets
    slat (usec): min=3, max=115749, avg=837.22, stdev=9154.30
    clat (usec): min=13, max=796066, avg=5094.86, stdev=22084.58
     lat (usec): min=34, max=883998, avg=5932.24, stdev=23741.76
    clat percentiles (usec):
     |  1.00th=[    41],  5.00th=[    45], 10.00th=[    47], 20.00th=[    49],
     | 30.00th=[    51], 40.00th=[    53], 50.00th=[    56], 60.00th=[    59],
     | 70.00th=[    67], 80.00th=[    77], 90.00th=[    88], 95.00th=[ 52167],
     | 99.00th=[107480], 99.50th=[107480], 99.90th=[111674], 99.95th=[111674],
     | 99.99th=[111674]
   bw (  KiB/s): min= 8882, max=4082248, per=100.00%, avg=47527.37, stdev=34550.32, samples=5997
   iops        : min= 2220, max=1020562, avg=11880.10, stdev=8637.60, samples=5997
  lat (usec)   : 20=0.01%, 50=25.46%, 100=67.57%, 250=1.88%, 500=0.02%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 20=0.01%, 50=0.03%, 100=1.30%, 250=3.73%
  lat (msec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=0.13%, sys=0.22%, ctx=35607, majf=0, minf=204
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1753144,3562657,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=10

Run status group 0 (all jobs):
   READ: bw=5809KiB/s (5949kB/s), 5809KiB/s-5809KiB/s (5949kB/s-5949kB/s), io=6848MiB (7181MB), run=1207117-1207117msec
  WRITE: bw=11.5MiB/s (12.1MB/s), 11.5MiB/s-11.5MiB/s (12.1MB/s-12.1MB/s), io=13.6GiB (14.6GB), run=1207117-1207117msec

Disk stats (read/write):
  sdb: ios=9/56641, merge=0/5, ticks=163/68002489, in_queue=68002661, util=99.90%